'''
Задача 1:
Распечатать в консоль матрицу 5 на 5, заполненную числами по порядку
1 2 3 4 5
6 7 8 9 10
11 12 13 14 15
16 17 18 19 20
21 22 23 24 25
'''

for i in range(1,26):
    print(i, end=" ")
    #print(f"{i} ")
    if i % 5 == 0:
        print('\n')

''' Решение из задания
for i in range(1, 26):
    if not i % 5:
        print (i)
    else:
        print (i, end=' ')
'''